# AllUsersAddinsLocation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ControlledApplication..::..AllUsersAddinsLocation Property
ControlledApplication Class See Also
---
The folder location for .addin files for all users.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string AllUsersAddinsLocation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AllUsersAddinsLocation As String
	Get
```

Visual C++
---
```text
public:
property String^ AllUsersAddinsLocation {
	String^ get ();
}
```

# See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace